load-test/results/baseline.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load-test/product-list.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 4m0s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 3m30s over 5 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 002/100 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 002/100 VUs  0m01.0s/3m30.0s

running (0m02.0s), 004/100 VUs, 2 complete and 0 interrupted iterations
default   [   1% ] 004/100 VUs  0m02.0s/3m30.0s

running (0m03.0s), 005/100 VUs, 3 complete and 0 interrupted iterations
default   [   1% ] 005/100 VUs  0m03.0s/3m30.0s

running (0m04.0s), 007/100 VUs, 7 complete and 0 interrupted iterations
default   [   2% ] 007/100 VUs  0m04.0s/3m30.0s

running (0m05.0s), 009/100 VUs, 13 complete and 0 interrupted iterations
default   [   2% ] 009/100 VUs  0m05.0s/3m30.0s

running (0m06.0s), 010/100 VUs, 19 complete and 0 interrupted iterations
default   [   3% ] 010/100 VUs  0m06.0s/3m30.0s

running (0m07.0s), 012/100 VUs, 27 complete and 0 interrupted iterations
default   [   3% ] 012/100 VUs  0m07.0s/3m30.0s

running (0m08.0s), 014/100 VUs, 33 complete and 0 interrupted iterations
default   [   4% ] 014/100 VUs  0m08.0s/3m30.0s

running (0m09.0s), 015/100 VUs, 41 complete and 0 interrupted iterations
default   [   4% ] 015/100 VUs  0m09.0s/3m30.0s

running (0m10.0s), 017/100 VUs, 53 complete and 0 interrupted iterations
default   [   5% ] 017/100 VUs  0m10.0s/3m30.0s

running (0m11.0s), 018/100 VUs, 69 complete and 0 interrupted iterations
default   [   5% ] 018/100 VUs  0m11.0s/3m30.0s

running (0m12.0s), 020/100 VUs, 82 complete and 0 interrupted iterations
default   [   6% ] 020/100 VUs  0m12.0s/3m30.0s

running (0m13.0s), 022/100 VUs, 98 complete and 0 interrupted iterations
default   [   6% ] 022/100 VUs  0m13.0s/3m30.0s

running (0m14.0s), 023/100 VUs, 110 complete and 0 interrupted iterations
default   [   7% ] 023/100 VUs  0m14.0s/3m30.0s

running (0m15.0s), 025/100 VUs, 130 complete and 0 interrupted iterations
default   [   7% ] 025/100 VUs  0m15.0s/3m30.0s

running (0m16.0s), 027/100 VUs, 150 complete and 0 interrupted iterations
default   [   8% ] 027/100 VUs  0m16.0s/3m30.0s

running (0m17.0s), 028/100 VUs, 172 complete and 0 interrupted iterations
default   [   8% ] 028/100 VUs  0m17.0s/3m30.0s

running (0m18.0s), 030/100 VUs, 188 complete and 0 interrupted iterations
default   [   9% ] 030/100 VUs  0m18.0s/3m30.0s

running (0m19.0s), 032/100 VUs, 213 complete and 0 interrupted iterations
default   [   9% ] 032/100 VUs  0m19.0s/3m30.0s

running (0m20.0s), 033/100 VUs, 238 complete and 0 interrupted iterations
default   [  10% ] 033/100 VUs  0m20.0s/3m30.0s

running (0m21.0s), 035/100 VUs, 269 complete and 0 interrupted iterations
default   [  10% ] 035/100 VUs  0m21.0s/3m30.0s

running (0m22.0s), 036/100 VUs, 289 complete and 0 interrupted iterations
default   [  10% ] 036/100 VUs  0m22.0s/3m30.0s

running (0m23.0s), 038/100 VUs, 318 complete and 0 interrupted iterations
default   [  11% ] 038/100 VUs  0m23.0s/3m30.0s

running (0m24.0s), 040/100 VUs, 350 complete and 0 interrupted iterations
default   [  11% ] 040/100 VUs  0m24.0s/3m30.0s

running (0m24.9s), 041/100 VUs, 376 complete and 0 interrupted iterations
default   [  12% ] 041/100 VUs  0m25.0s/3m30.0s

running (0m25.9s), 043/100 VUs, 409 complete and 0 interrupted iterations
default   [  12% ] 043/100 VUs  0m26.0s/3m30.0s

running (0m26.9s), 045/100 VUs, 444 complete and 0 interrupted iterations
default   [  13% ] 045/100 VUs  0m27.0s/3m30.0s

running (0m27.9s), 046/100 VUs, 476 complete and 0 interrupted iterations
default   [  13% ] 046/100 VUs  0m28.0s/3m30.0s

running (0m28.9s), 048/100 VUs, 506 complete and 0 interrupted iterations
default   [  14% ] 048/100 VUs  0m29.0s/3m30.0s

running (0m29.9s), 049/100 VUs, 546 complete and 0 interrupted iterations
default   [  14% ] 049/100 VUs  0m30.0s/3m30.0s

running (0m30.9s), 050/100 VUs, 581 complete and 0 interrupted iterations
default   [  15% ] 050/100 VUs  0m31.0s/3m30.0s

running (0m31.9s), 050/100 VUs, 621 complete and 0 interrupted iterations
default   [  15% ] 050/100 VUs  0m32.0s/3m30.0s

running (0m32.9s), 050/100 VUs, 660 complete and 0 interrupted iterations
default   [  16% ] 050/100 VUs  0m33.0s/3m30.0s

running (0m33.9s), 050/100 VUs, 699 complete and 0 interrupted iterations
default   [  16% ] 050/100 VUs  0m34.0s/3m30.0s

running (0m34.9s), 050/100 VUs, 735 complete and 0 interrupted iterations
default   [  17% ] 050/100 VUs  0m35.0s/3m30.0s

running (0m35.9s), 050/100 VUs, 777 complete and 0 interrupted iterations
default   [  17% ] 050/100 VUs  0m36.0s/3m30.0s

running (0m36.9s), 050/100 VUs, 811 complete and 0 interrupted iterations
default   [  18% ] 050/100 VUs  0m37.0s/3m30.0s

running (0m37.9s), 050/100 VUs, 853 complete and 0 interrupted iterations
default   [  18% ] 050/100 VUs  0m38.0s/3m30.0s

running (0m38.9s), 050/100 VUs, 888 complete and 0 interrupted iterations
default   [  19% ] 050/100 VUs  0m39.0s/3m30.0s

running (0m39.9s), 050/100 VUs, 929 complete and 0 interrupted iterations
default   [  19% ] 050/100 VUs  0m40.0s/3m30.0s

running (0m40.9s), 050/100 VUs, 963 complete and 0 interrupted iterations
default   [  20% ] 050/100 VUs  0m41.0s/3m30.0s

running (0m41.9s), 050/100 VUs, 1001 complete and 0 interrupted iterations
default   [  20% ] 050/100 VUs  0m42.0s/3m30.0s

running (0m42.9s), 050/100 VUs, 1040 complete and 0 interrupted iterations
default   [  20% ] 050/100 VUs  0m43.0s/3m30.0s

running (0m43.9s), 050/100 VUs, 1081 complete and 0 interrupted iterations
default   [  21% ] 050/100 VUs  0m44.0s/3m30.0s

running (0m44.9s), 050/100 VUs, 1121 complete and 0 interrupted iterations
default   [  21% ] 050/100 VUs  0m45.0s/3m30.0s

running (0m45.9s), 050/100 VUs, 1160 complete and 0 interrupted iterations
default   [  22% ] 050/100 VUs  0m46.0s/3m30.0s

running (0m46.9s), 050/100 VUs, 1201 complete and 0 interrupted iterations
default   [  22% ] 050/100 VUs  0m47.0s/3m30.0s

running (0m47.9s), 050/100 VUs, 1234 complete and 0 interrupted iterations
default   [  23% ] 050/100 VUs  0m48.0s/3m30.0s

running (0m48.9s), 050/100 VUs, 1277 complete and 0 interrupted iterations
default   [  23% ] 050/100 VUs  0m49.0s/3m30.0s

running (0m49.9s), 050/100 VUs, 1315 complete and 0 interrupted iterations
default   [  24% ] 050/100 VUs  0m50.0s/3m30.0s

running (0m50.9s), 050/100 VUs, 1348 complete and 0 interrupted iterations
default   [  24% ] 050/100 VUs  0m51.0s/3m30.0s

running (0m51.9s), 050/100 VUs, 1392 complete and 0 interrupted iterations
default   [  25% ] 050/100 VUs  0m52.0s/3m30.0s

running (0m52.9s), 050/100 VUs, 1427 complete and 0 interrupted iterations
default   [  25% ] 050/100 VUs  0m53.0s/3m30.0s

running (0m53.9s), 050/100 VUs, 1465 complete and 0 interrupted iterations
default   [  26% ] 050/100 VUs  0m54.0s/3m30.0s

running (0m54.8s), 050/100 VUs, 1503 complete and 0 interrupted iterations
default   [  26% ] 050/100 VUs  0m55.0s/3m30.0s

running (0m55.8s), 050/100 VUs, 1539 complete and 0 interrupted iterations
default   [  27% ] 050/100 VUs  0m56.0s/3m30.0s

running (0m56.8s), 050/100 VUs, 1578 complete and 0 interrupted iterations
default   [  27% ] 050/100 VUs  0m57.0s/3m30.0s

running (0m57.8s), 050/100 VUs, 1617 complete and 0 interrupted iterations
default   [  28% ] 050/100 VUs  0m58.0s/3m30.0s

running (0m58.8s), 050/100 VUs, 1654 complete and 0 interrupted iterations
default   [  28% ] 050/100 VUs  0m59.0s/3m30.0s

running (0m59.8s), 050/100 VUs, 1700 complete and 0 interrupted iterations
default   [  29% ] 050/100 VUs  1m00.0s/3m30.0s

running (1m00.8s), 050/100 VUs, 1736 complete and 0 interrupted iterations
default   [  29% ] 050/100 VUs  1m01.0s/3m30.0s

running (1m01.8s), 050/100 VUs, 1780 complete and 0 interrupted iterations
default   [  30% ] 050/100 VUs  1m02.0s/3m30.0s

running (1m02.8s), 050/100 VUs, 1815 complete and 0 interrupted iterations
default   [  30% ] 050/100 VUs  1m03.0s/3m30.0s

running (1m03.8s), 050/100 VUs, 1858 complete and 0 interrupted iterations
default   [  30% ] 050/100 VUs  1m04.0s/3m30.0s

running (1m04.8s), 050/100 VUs, 1899 complete and 0 interrupted iterations
default   [  31% ] 050/100 VUs  1m05.0s/3m30.0s

running (1m05.8s), 050/100 VUs, 1940 complete and 0 interrupted iterations
default   [  31% ] 050/100 VUs  1m06.0s/3m30.0s

running (1m06.8s), 050/100 VUs, 1983 complete and 0 interrupted iterations
default   [  32% ] 050/100 VUs  1m07.0s/3m30.0s

running (1m07.8s), 050/100 VUs, 2015 complete and 0 interrupted iterations
default   [  32% ] 050/100 VUs  1m08.0s/3m30.0s

running (1m08.8s), 050/100 VUs, 2053 complete and 0 interrupted iterations
default   [  33% ] 050/100 VUs  1m09.0s/3m30.0s

running (1m09.8s), 050/100 VUs, 2092 complete and 0 interrupted iterations
default   [  33% ] 050/100 VUs  1m10.0s/3m30.0s

running (1m10.8s), 050/100 VUs, 2128 complete and 0 interrupted iterations
default   [  34% ] 050/100 VUs  1m11.0s/3m30.0s

running (1m11.8s), 050/100 VUs, 2171 complete and 0 interrupted iterations
default   [  34% ] 050/100 VUs  1m12.0s/3m30.0s

running (1m12.8s), 050/100 VUs, 2209 complete and 0 interrupted iterations
default   [  35% ] 050/100 VUs  1m13.0s/3m30.0s

running (1m13.8s), 050/100 VUs, 2244 complete and 0 interrupted iterations
default   [  35% ] 050/100 VUs  1m14.0s/3m30.0s

running (1m14.8s), 050/100 VUs, 2286 complete and 0 interrupted iterations
default   [  36% ] 050/100 VUs  1m15.0s/3m30.0s

running (1m15.8s), 050/100 VUs, 2325 complete and 0 interrupted iterations
default   [  36% ] 050/100 VUs  1m16.0s/3m30.0s

running (1m16.8s), 050/100 VUs, 2364 complete and 0 interrupted iterations
default   [  37% ] 050/100 VUs  1m17.0s/3m30.0s

running (1m17.8s), 050/100 VUs, 2406 complete and 0 interrupted iterations
default   [  37% ] 050/100 VUs  1m18.0s/3m30.0s

running (1m18.8s), 050/100 VUs, 2441 complete and 0 interrupted iterations
default   [  38% ] 050/100 VUs  1m19.0s/3m30.0s

running (1m19.8s), 050/100 VUs, 2480 complete and 0 interrupted iterations
default   [  38% ] 050/100 VUs  1m20.0s/3m30.0s

running (1m20.8s), 050/100 VUs, 2518 complete and 0 interrupted iterations
default   [  39% ] 050/100 VUs  1m21.0s/3m30.0s

running (1m21.8s), 050/100 VUs, 2552 complete and 0 interrupted iterations
default   [  39% ] 050/100 VUs  1m22.0s/3m30.0s

running (1m22.8s), 050/100 VUs, 2590 complete and 0 interrupted iterations
default   [  40% ] 050/100 VUs  1m23.0s/3m30.0s

running (1m23.8s), 050/100 VUs, 2626 complete and 0 interrupted iterations
default   [  40% ] 050/100 VUs  1m24.0s/3m30.0s

running (1m24.7s), 050/100 VUs, 2668 complete and 0 interrupted iterations
default   [  40% ] 050/100 VUs  1m25.0s/3m30.0s

running (1m25.7s), 050/100 VUs, 2703 complete and 0 interrupted iterations
default   [  41% ] 050/100 VUs  1m26.0s/3m30.0s

running (1m26.7s), 050/100 VUs, 2746 complete and 0 interrupted iterations
default   [  41% ] 050/100 VUs  1m27.0s/3m30.0s

running (1m27.7s), 050/100 VUs, 2783 complete and 0 interrupted iterations
default   [  42% ] 050/100 VUs  1m28.0s/3m30.0s

running (1m28.7s), 050/100 VUs, 2822 complete and 0 interrupted iterations
default   [  42% ] 050/100 VUs  1m29.0s/3m30.0s

running (1m29.7s), 050/100 VUs, 2861 complete and 0 interrupted iterations
default   [  43% ] 050/100 VUs  1m30.0s/3m30.0s

running (1m30.7s), 051/100 VUs, 2904 complete and 0 interrupted iterations
default   [  43% ] 051/100 VUs  1m31.0s/3m30.0s

running (1m31.7s), 053/100 VUs, 2943 complete and 0 interrupted iterations
default   [  44% ] 053/100 VUs  1m32.0s/3m30.0s

running (1m32.7s), 054/100 VUs, 2988 complete and 0 interrupted iterations
default   [  44% ] 054/100 VUs  1m33.0s/3m30.0s

running (1m33.7s), 056/100 VUs, 3027 complete and 0 interrupted iterations
default   [  45% ] 056/100 VUs  1m34.0s/3m30.0s

running (1m34.7s), 058/100 VUs, 3070 complete and 0 interrupted iterations
default   [  45% ] 058/100 VUs  1m35.0s/3m30.0s

running (1m35.7s), 059/100 VUs, 3117 complete and 0 interrupted iterations
default   [  46% ] 059/100 VUs  1m36.0s/3m30.0s

running (1m36.7s), 061/100 VUs, 3162 complete and 0 interrupted iterations
default   [  46% ] 061/100 VUs  1m37.0s/3m30.0s

running (1m37.7s), 063/100 VUs, 3217 complete and 0 interrupted iterations
default   [  47% ] 063/100 VUs  1m38.0s/3m30.0s

running (1m38.7s), 064/100 VUs, 3252 complete and 0 interrupted iterations
default   [  47% ] 064/100 VUs  1m39.0s/3m30.0s

running (1m39.7s), 066/100 VUs, 3310 complete and 0 interrupted iterations
default   [  48% ] 066/100 VUs  1m40.0s/3m30.0s

running (1m40.7s), 068/100 VUs, 3362 complete and 0 interrupted iterations
default   [  48% ] 068/100 VUs  1m41.0s/3m30.0s

running (1m41.7s), 069/100 VUs, 3413 complete and 0 interrupted iterations
default   [  49% ] 069/100 VUs  1m42.0s/3m30.0s

running (1m42.7s), 071/100 VUs, 3469 complete and 0 interrupted iterations
default   [  49% ] 071/100 VUs  1m43.0s/3m30.0s

running (1m43.7s), 073/100 VUs, 3521 complete and 0 interrupted iterations
default   [  50% ] 073/100 VUs  1m44.0s/3m30.0s

running (1m44.7s), 074/100 VUs, 3578 complete and 0 interrupted iterations
default   [  50% ] 074/100 VUs  1m45.0s/3m30.0s

running (1m45.7s), 076/100 VUs, 3645 complete and 0 interrupted iterations
default   [  50% ] 076/100 VUs  1m46.0s/3m30.0s

running (1m46.7s), 078/100 VUs, 3707 complete and 0 interrupted iterations
default   [  51% ] 078/100 VUs  1m47.0s/3m30.0s

running (1m47.7s), 079/100 VUs, 3771 complete and 0 interrupted iterations
default   [  51% ] 079/100 VUs  1m48.0s/3m30.0s

running (1m48.7s), 081/100 VUs, 3833 complete and 0 interrupted iterations
default   [  52% ] 081/100 VUs  1m49.0s/3m30.0s

running (1m49.7s), 083/100 VUs, 3902 complete and 0 interrupted iterations
default   [  52% ] 083/100 VUs  1m50.0s/3m30.0s

running (1m50.7s), 084/100 VUs, 3966 complete and 0 interrupted iterations
default   [  53% ] 084/100 VUs  1m51.0s/3m30.0s

running (1m51.7s), 086/100 VUs, 4040 complete and 0 interrupted iterations
default   [  53% ] 086/100 VUs  1m52.0s/3m30.0s

running (1m52.7s), 088/100 VUs, 4094 complete and 0 interrupted iterations
default   [  54% ] 088/100 VUs  1m53.0s/3m30.0s

running (1m53.7s), 089/100 VUs, 4157 complete and 0 interrupted iterations
default   [  54% ] 089/100 VUs  1m54.0s/3m30.0s

running (1m54.6s), 091/100 VUs, 4222 complete and 0 interrupted iterations
default   [  55% ] 091/100 VUs  1m55.0s/3m30.0s

running (1m55.6s), 093/100 VUs, 4303 complete and 0 interrupted iterations
default   [  55% ] 093/100 VUs  1m56.0s/3m30.0s

running (1m56.6s), 094/100 VUs, 4375 complete and 0 interrupted iterations
default   [  56% ] 094/100 VUs  1m57.0s/3m30.0s

running (1m57.6s), 096/100 VUs, 4451 complete and 0 interrupted iterations
default   [  56% ] 096/100 VUs  1m58.0s/3m30.0s

running (1m58.6s), 098/100 VUs, 4520 complete and 0 interrupted iterations
default   [  57% ] 098/100 VUs  1m59.0s/3m30.0s

running (1m59.6s), 099/100 VUs, 4598 complete and 0 interrupted iterations
default   [  57% ] 099/100 VUs  2m00.0s/3m30.0s

running (2m00.6s), 100/100 VUs, 4679 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  2m01.0s/3m30.0s

running (2m01.6s), 100/100 VUs, 4747 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  2m02.0s/3m30.0s

running (2m02.6s), 100/100 VUs, 4816 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  2m03.0s/3m30.0s

running (2m03.6s), 100/100 VUs, 4895 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  2m04.0s/3m30.0s

running (2m04.6s), 100/100 VUs, 4969 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  2m05.0s/3m30.0s

running (2m05.6s), 100/100 VUs, 5053 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  2m06.0s/3m30.0s

running (2m06.6s), 100/100 VUs, 5128 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  2m07.0s/3m30.0s

running (2m07.6s), 100/100 VUs, 5210 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  2m08.0s/3m30.0s

running (2m08.6s), 100/100 VUs, 5284 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  2m09.0s/3m30.0s

running (2m09.6s), 100/100 VUs, 5361 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  2m10.0s/3m30.0s

running (2m10.6s), 100/100 VUs, 5432 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  2m11.0s/3m30.0s

running (2m11.6s), 100/100 VUs, 5504 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  2m12.0s/3m30.0s

running (2m12.6s), 100/100 VUs, 5571 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  2m13.0s/3m30.0s

running (2m13.6s), 100/100 VUs, 5651 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  2m14.0s/3m30.0s

running (2m14.6s), 100/100 VUs, 5724 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  2m15.0s/3m30.0s

running (2m15.6s), 100/100 VUs, 5798 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  2m16.0s/3m30.0s

running (2m16.6s), 100/100 VUs, 5877 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  2m17.0s/3m30.0s

running (2m17.6s), 100/100 VUs, 5955 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  2m18.0s/3m30.0s

running (2m18.6s), 100/100 VUs, 6040 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  2m19.0s/3m30.0s

running (2m19.6s), 100/100 VUs, 6116 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m20.0s/3m30.0s

running (2m20.6s), 100/100 VUs, 6192 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  2m21.0s/3m30.0s

running (2m21.6s), 100/100 VUs, 6277 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  2m22.0s/3m30.0s

running (2m22.6s), 100/100 VUs, 6348 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  2m23.0s/3m30.0s

running (2m23.6s), 100/100 VUs, 6424 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  2m24.0s/3m30.0s

running (2m24.5s), 100/100 VUs, 6511 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  2m25.0s/3m30.0s

running (2m25.5s), 100/100 VUs, 6600 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m26.0s/3m30.0s

running (2m26.5s), 100/100 VUs, 6662 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m27.0s/3m30.0s

running (2m27.5s), 100/100 VUs, 6752 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  2m28.0s/3m30.0s

running (2m28.5s), 100/100 VUs, 6827 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  2m29.0s/3m30.0s

running (2m29.5s), 100/100 VUs, 6897 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  2m30.0s/3m30.0s

running (2m30.5s), 100/100 VUs, 6977 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m31.0s/3m30.0s

running (2m31.5s), 100/100 VUs, 7058 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  2m32.0s/3m30.0s

running (2m32.5s), 100/100 VUs, 7133 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  2m33.0s/3m30.0s

running (2m33.5s), 100/100 VUs, 7216 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  2m34.0s/3m30.0s

running (2m34.5s), 100/100 VUs, 7292 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m35.0s/3m30.0s

running (2m35.5s), 100/100 VUs, 7375 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  2m36.0s/3m30.0s

running (2m36.5s), 100/100 VUs, 7442 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  2m37.0s/3m30.0s

running (2m37.5s), 100/100 VUs, 7519 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  2m38.0s/3m30.0s

running (2m38.5s), 100/100 VUs, 7595 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  2m39.0s/3m30.0s

running (2m39.5s), 100/100 VUs, 7669 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  2m40.0s/3m30.0s

running (2m40.5s), 100/100 VUs, 7751 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  2m41.0s/3m30.0s

running (2m41.5s), 100/100 VUs, 7825 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  2m42.0s/3m30.0s

running (2m42.5s), 100/100 VUs, 7912 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  2m43.0s/3m30.0s

running (2m43.5s), 100/100 VUs, 7991 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  2m44.0s/3m30.0s

running (2m44.5s), 100/100 VUs, 8064 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  2m45.0s/3m30.0s

running (2m45.5s), 100/100 VUs, 8148 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  2m46.0s/3m30.0s

running (2m46.5s), 100/100 VUs, 8220 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  2m47.0s/3m30.0s

running (2m47.5s), 100/100 VUs, 8302 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  2m48.0s/3m30.0s

running (2m48.5s), 100/100 VUs, 8379 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  2m49.0s/3m30.0s

running (2m49.5s), 100/100 VUs, 8456 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  2m50.0s/3m30.0s

running (2m50.5s), 100/100 VUs, 8531 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  2m51.0s/3m30.0s

running (2m51.5s), 100/100 VUs, 8611 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  2m52.0s/3m30.0s

running (2m52.5s), 100/100 VUs, 8681 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  2m53.0s/3m30.0s

running (2m53.5s), 100/100 VUs, 8762 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  2m54.0s/3m30.0s

running (2m54.4s), 100/100 VUs, 8850 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  2m55.0s/3m30.0s

running (2m55.4s), 100/100 VUs, 8928 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  2m56.0s/3m30.0s

running (2m56.4s), 100/100 VUs, 9008 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  2m57.0s/3m30.0s

running (2m57.4s), 100/100 VUs, 9084 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  2m58.0s/3m30.0s

running (2m58.4s), 100/100 VUs, 9164 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  2m59.0s/3m30.0s

running (2m59.4s), 100/100 VUs, 9244 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  3m00.0s/3m30.0s

running (3m00.4s), 099/100 VUs, 9320 complete and 0 interrupted iterations
default   [  86% ] 099/100 VUs  3m01.0s/3m30.0s

running (3m01.4s), 097/100 VUs, 9395 complete and 0 interrupted iterations
default   [  87% ] 097/100 VUs  3m02.0s/3m30.0s

running (3m02.4s), 094/100 VUs, 9473 complete and 0 interrupted iterations
default   [  87% ] 094/100 VUs  3m03.0s/3m30.0s

running (3m03.4s), 088/100 VUs, 9552 complete and 0 interrupted iterations
default   [  88% ] 088/100 VUs  3m04.0s/3m30.0s

running (3m04.4s), 086/100 VUs, 9621 complete and 0 interrupted iterations
default   [  88% ] 086/100 VUs  3m05.0s/3m30.0s

running (3m05.4s), 083/100 VUs, 9681 complete and 0 interrupted iterations
default   [  89% ] 083/100 VUs  3m06.0s/3m30.0s

running (3m06.4s), 079/100 VUs, 9756 complete and 0 interrupted iterations
default   [  89% ] 079/100 VUs  3m07.0s/3m30.0s

running (3m07.4s), 076/100 VUs, 9799 complete and 0 interrupted iterations
default   [  90% ] 076/100 VUs  3m08.0s/3m30.0s

running (3m08.4s), 073/100 VUs, 9860 complete and 0 interrupted iterations
default   [  90% ] 073/100 VUs  3m09.0s/3m30.0s

running (3m09.4s), 071/100 VUs, 9920 complete and 0 interrupted iterations
default   [  90% ] 071/100 VUs  3m10.0s/3m30.0s

running (3m10.4s), 065/100 VUs, 9977 complete and 0 interrupted iterations
default   [  91% ] 065/100 VUs  3m11.0s/3m30.0s

running (3m11.4s), 061/100 VUs, 10023 complete and 0 interrupted iterations
default   [  91% ] 061/100 VUs  3m12.0s/3m30.0s

running (3m12.4s), 059/100 VUs, 10071 complete and 0 interrupted iterations
default   [  92% ] 059/100 VUs  3m13.0s/3m30.0s

running (3m13.4s), 056/100 VUs, 10120 complete and 0 interrupted iterations
default   [  92% ] 056/100 VUs  3m14.0s/3m30.0s

running (3m14.4s), 051/100 VUs, 10162 complete and 0 interrupted iterations
default   [  93% ] 051/100 VUs  3m15.0s/3m30.0s

running (3m15.4s), 050/100 VUs, 10209 complete and 0 interrupted iterations
default   [  93% ] 050/100 VUs  3m16.0s/3m30.0s

running (3m16.4s), 046/100 VUs, 10249 complete and 0 interrupted iterations
default   [  94% ] 046/100 VUs  3m17.0s/3m30.0s

running (3m17.4s), 042/100 VUs, 10285 complete and 0 interrupted iterations
default   [  94% ] 042/100 VUs  3m18.0s/3m30.0s

running (3m18.4s), 039/100 VUs, 10318 complete and 0 interrupted iterations
default   [  95% ] 039/100 VUs  3m19.0s/3m30.0s

running (3m19.4s), 036/100 VUs, 10346 complete and 0 interrupted iterations
default   [  95% ] 036/100 VUs  3m20.0s/3m30.0s

running (3m20.4s), 033/100 VUs, 10374 complete and 0 interrupted iterations
default   [  96% ] 033/100 VUs  3m21.0s/3m30.0s

running (3m21.4s), 029/100 VUs, 10406 complete and 0 interrupted iterations
default   [  96% ] 029/100 VUs  3m22.0s/3m30.0s

running (3m22.4s), 027/100 VUs, 10422 complete and 0 interrupted iterations
default   [  97% ] 027/100 VUs  3m23.0s/3m30.0s

running (3m23.4s), 023/100 VUs, 10443 complete and 0 interrupted iterations
default   [  97% ] 023/100 VUs  3m24.0s/3m30.0s

running (3m24.4s), 021/100 VUs, 10460 complete and 0 interrupted iterations
default   [  98% ] 021/100 VUs  3m25.0s/3m30.0s

running (3m25.4s), 018/100 VUs, 10479 complete and 0 interrupted iterations
default   [  98% ] 018/100 VUs  3m26.0s/3m30.0s

running (3m26.4s), 013/100 VUs, 10492 complete and 0 interrupted iterations
default   [  99% ] 013/100 VUs  3m27.0s/3m30.0s

running (3m27.4s), 009/100 VUs, 10500 complete and 0 interrupted iterations
default   [  99% ] 009/100 VUs  3m28.0s/3m30.0s

running (3m28.4s), 004/100 VUs, 10507 complete and 0 interrupted iterations
default   [ 100% ] 004/100 VUs  3m29.0s/3m30.0s

running (3m29.4s), 002/100 VUs, 10511 complete and 0 interrupted iterations
default   [ 100% ] 002/100 VUs  3m30.0s/3m30.0s

     ✓ status 200
     ✓ has data

     checks.........................: 100.00% 21026 out of 21026
     data_received..................: 124 MB  590 kB/s
     data_sent......................: 1.3 MB  6.2 kB/s
     http_req_blocked...............: avg=18.62µs  min=2.05µs   med=6.99µs   max=56.04ms  p(90)=10.06µs  p(95)=12.79µs 
     http_req_connecting............: avg=9.44µs   min=0s       med=0s       max=55.97ms  p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=42.75ms  min=111.81µs med=41.66ms  max=386.3ms  p(90)=64.62ms  p(95)=80.24ms 
       { expected_response:true }...: avg=42.75ms  min=111.81µs med=41.66ms  max=386.3ms  p(90)=64.62ms  p(95)=80.24ms 
   ✓ http_req_failed................: 0.00%   0 out of 10513
     http_req_receiving.............: avg=235.34µs min=29.97µs  med=198.26µs max=15.41ms  p(90)=347.44µs p(95)=432.38µs
     http_req_sending...............: avg=36.02µs  min=6.24µs   med=31.14µs  max=7.43ms   p(90)=53.59µs  p(95)=68.66µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=42.48ms  min=0s       med=41.37ms  max=386.16ms p(90)=64.36ms  p(95)=79.92ms 
     http_reqs......................: 10513   50.087867/s
     iteration_duration.............: avg=1.29s    min=512.68ms med=1.28s    max=2.24s    p(90)=1.9s     p(95)=1.97s   
     iterations.....................: 10513   50.087867/s
     list_errors....................: 0.00%   0 out of 10513
   ✓ list_latency...................: avg=42.75ms  min=111.81µs med=41.66ms  max=386.3ms  p(90)=64.62ms  p(95)=80.24ms 
     vus............................: 2       min=2              max=100
     vus_max........................: 100     min=100            max=100


running (3m29.9s), 000/100 VUs, 10513 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  3m30s